# Cleansing data using numpy and pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
df_cleaning = pd.read_csv('data/Data.csv')

In [3]:
df_cleaning.head()

   Country   Age    Salry Purchased
0   France  44.0  '72000'        No
1    Spain  27.0  '48000'       Yes
2  Germany  30.0  '54000'        No
3    Spain  38.0  '61000'        No
4  Germany  40.0       ''       Yes

In [4]:
df_cleaning.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salry      10 non-null     object
 3   Purchased  10 non-null     object
dtypes: float64(1), object(3)
memory usage: 448.0+ bytes

### Issues found from preliminary EDA

1. Missing value in Age column
2. Mispelled column (Salry)
3. Incorrect data entry for column Salry
4. Incorrect data type for column Salry

### Impute missing value from Age column

In [5]:
df_cleaning['Age']

0    44.0
1    27.0
2    30.0
3    38.0
4    40.0
5    35.0
6     NaN
7    48.0
8    50.0
9    37.0
Name: Age, dtype: float64

In [6]:
df_cleaning['Age'].fillna(df_cleaning['Age'].mean())

0    44.000000
1    27.000000
2    30.000000
3    38.000000
4    40.000000
5    35.000000
6    38.777778
7    48.000000
8    50.000000
9    37.000000
Name: Age, dtype: float64

In [7]:
df_cleaning['Age'].fillna(round(df_cleaning['Age'].mean()))

0    44.0
1    27.0
2    30.0
3    38.0
4    40.0
5    35.0
6    39.0
7    48.0
8    50.0
9    37.0
Name: Age, dtype: float64

In [8]:
df_cleaning['Age'].fillna(df_cleaning['Age'].mode())

0    44.0
1    27.0
2    30.0
3    38.0
4    40.0
5    35.0
6    44.0
7    48.0
8    50.0
9    37.0
Name: Age, dtype: float64

In [9]:
df_cleaning['Age'].fillna(df_cleaning['Age'].median())

0    44.0
1    27.0
2    30.0
3    38.0
4    40.0
5    35.0
6    38.0
7    48.0
8    50.0
9    37.0
Name: Age, dtype: float64

In [10]:
df_cleaning['Age'].sort_values()

1    27.0
2    30.0
5    35.0
9    37.0
3    38.0
4    40.0
0    44.0
7    48.0
8    50.0
6     NaN
Name: Age, dtype: float64

In [11]:
df_cleaning['Age'].fillna(round(df_cleaning['Age'].mean()), inplace=True)

In [12]:
df_cleaning['Age']

0    44.0
1    27.0
2    30.0
3    38.0
4    40.0
5    35.0
6    39.0
7    48.0
8    50.0
9    37.0
Name: Age, dtype: float64

### Rename Salry column

In [13]:
df_cleaning.rename(columns={'Salry':'Salary'}, inplace=True)

In [14]:
df_cleaning.columns

Index(['Country', 'Age', 'Salary', 'Purchased'], dtype='object')

### Cleanse entries in Salary column

In [15]:
df_cleaning['Salary']

0    '72000'
1    '48000'
2    '54000'
3    '61000'
4         ''
5    '58000'
6    '52000'
7    '79000'
8    '83000'
9    '67000'
Name: Salary, dtype: object

In [16]:
df_cleaning['Salary'] = [i.strip("''") for i in df_cleaning['Salary'].values]

In [17]:
df_cleaning.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        10 non-null     float64
 2   Salary     10 non-null     object
 3   Purchased  10 non-null     object
dtypes: float64(1), object(3)
memory usage: 448.0+ bytes

In [18]:
df_cleaning['Salary'].isna()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: Salary, dtype: bool

In [19]:
df_cleaning['Salary'].replace("",np.nan, inplace=True)

### Change data type of Salary column

In [20]:
df_cleaning['Salary']

0    72000
1    48000
2    54000
3    61000
4      NaN
5    58000
6    52000
7    79000
8    83000
9    67000
Name: Salary, dtype: object

In [26]:
df_cleaning['Salary'] = df_cleaning['Salary'].astype('float')

### Impute 0 with mean of salaries

In [30]:
df_cleaning['Salary'].fillna(round(df_cleaning['Salary'].mean()), inplace=True)

In [31]:
df_cleaning

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0  63778.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  39.0  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes